routes/api.php

});

Route::apiResource('bookable', 'Api\BookableController')->only(['index','show']);
Route::get('bookables/{bookable}/availability','Api\BookableAvailabilityController')
        ->name('bookables.availability.show');
---
select * from `bookables`